In [1]:
import pandas as pd
import numpy as np

data = pd.Series(np.random.uniform(size=9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    0.840511
   2    0.326258
   3    0.348271
b  1    0.979730
   3    0.986212
c  1    0.936523
   2    0.159206
d  2    0.634443
   3    0.707190
dtype: float64

In [2]:
data.index

MultiIndex([('a', 1),
            ('a', 2),
            ('a', 3),
            ('b', 1),
            ('b', 3),
            ('c', 1),
            ('c', 2),
            ('d', 2),
            ('d', 3)],
           )

In [3]:
data['b']

1    0.979730
3    0.986212
dtype: float64

In [4]:
data['b':'c']

b  1    0.979730
   3    0.986212
c  1    0.936523
   2    0.159206
dtype: float64

In [5]:
data.loc[['b', 'd']]

b  1    0.979730
   3    0.986212
d  2    0.634443
   3    0.707190
dtype: float64

In [6]:
data.loc[:, 2]

a    0.326258
c    0.159206
d    0.634443
dtype: float64

In [7]:
data.unstack()

          1         2         3
a  0.840511  0.326258  0.348271
b  0.979730       NaN  0.986212
c  0.936523  0.159206       NaN
d       NaN  0.634443  0.707190

In [8]:
data.unstack().stack()

a  1    0.840511
   2    0.326258
   3    0.348271
b  1    0.979730
   3    0.986212
c  1    0.936523
   2    0.159206
d  2    0.634443
   3    0.707190
dtype: float64

In [9]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                        index=[['a', 'a', 'b', 'b'],
                                [1, 2, 1, 2]],
                        columns=[['Ohio', 'Ohio', 'Colorado'],
                                ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [10]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']

In [11]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [12]:
frame.index.nlevels

2

In [13]:
frame.columns.nlevels

2

In [14]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [15]:
pd.MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'],
                            ['Green', 'Red', 'Green']],
                            names=['state', 'color'])

MultiIndex([(    'Ohio', 'Green'),
            (    'Ohio',   'Red'),
            ('Colorado', 'Green')],
           names=['state', 'color'])

In [16]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [17]:
frame.sort_index()

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [18]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [19]:
frame.sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [20]:
frame.sort_index(level=1, axis=1)

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [21]:
frame.swaplevel(0, 1).sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [22]:
frame.groupby(level='key2').sum()

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [23]:
frame.T.groupby(level='color').sum().T

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

In [24]:
frame = pd.DataFrame({'a': range(7), 'b': range(7, 0, -1),
                     'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                     'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [25]:
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [26]:
frame.set_index(['c', 'd'], drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [27]:
frame2.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [28]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': pd.Series(range(7), dtype='Int64')})
df2 = pd.DataFrame({'key': ['a', 'b', 'd'],
                    'data2': pd.Series(range(3), dtype='Int64')})
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [29]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [30]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [31]:
pd.merge(df2, df1)

  key  data2  data1
0   a      0      2
1   a      0      4
2   a      0      5
3   b      1      0
4   b      1      1
5   b      1      6

In [32]:
pd.merge(df1, df2, on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   a      4      0
4   a      5      0
5   b      6      1

In [33]:
df3 = pd.DataFrame({'lkey': ['b', 'b', 'a', 'c', 'a', 'a', 'b'],
                    'data1': pd.Series(range(7), dtype='Int64')})
df4 = pd.DataFrame({'rkey': ['a', 'b', 'd'],
                    'data2': pd.Series(range(3), dtype='Int64')})
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0
5    b      6    b      1

In [34]:
pd.merge(df1, df2, how='outer')

  key  data1  data2
0   a      2      0
1   a      4      0
2   a      5      0
3   b      0      1
4   b      1      1
5   b      6      1
6   c      3   <NA>
7   d   <NA>      2

In [35]:
pd.merge(df1, df2, how='left')

  key  data1  data2
0   b      0      1
1   b      1      1
2   a      2      0
3   c      3   <NA>
4   a      4      0
5   a      5      0
6   b      6      1

In [36]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey', how='outer')

  lkey  data1 rkey  data2
0    a      2    a      0
1    a      4    a      0
2    a      5    a      0
3    b      0    b      1
4    b      1    b      1
5    b      6    b      1
6    c      3  NaN   <NA>
7  NaN   <NA>    d      2

In [37]:
pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    a      2    a      0
3    a      4    a      0
4    a      5    a      0
5    b      6    b      1

In [38]:
df1 = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                    'data1': pd.Series(range(6), dtype='Int64')})
df2 = pd.DataFrame({'key': ['a', 'b', 'a', 'b', 'd'],
                    'data2': pd.Series(range(5), dtype='Int64')})
pd.merge(df1, df2, on='key', how='left')

   key  data1  data2
0    b      0      1
1    b      0      3
2    b      1      1
3    b      1      3
4    a      2      0
5    a      2      2
6    c      3   <NA>
7    a      4      0
8    a      4      2
9    b      5      1
10   b      5      3

In [39]:
pd.merge(df1, df2, how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [40]:
pd.merge(df1, df2)

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   a      2      0
5   a      2      2
6   a      4      0
7   a      4      2
8   b      5      1
9   b      5      3

In [41]:
left = pd.DataFrame({'key1': ['foo', 'foo', 'bar'],
                     'key2': ['one', 'two', 'one'],
                     'lval': pd.Series([1, 2, 3], dtype='Int64')})
right = pd.DataFrame({'key1': ['foo', 'foo', 'bar', 'bar'],
                      'key2': ['one', 'one', 'one', 'two'],
                      'rval': pd.Series([4, 5, 6, 7], dtype='Int64')})
pd.merge(left, right, on=['key1', 'key2'], how='outer')

  key1 key2  lval  rval
0  bar  one     3     6
1  bar  two  <NA>     7
2  foo  one     1     4
3  foo  one     1     5
4  foo  two     2  <NA>

In [42]:
pd.merge(left, right, on='key1')

  key1 key2_x  lval key2_y  rval
0  foo    one     1    one     4
1  foo    one     1    one     5
2  foo    two     2    one     4
3  foo    two     2    one     5
4  bar    one     3    one     6
5  bar    one     3    two     7

In [43]:
pd.merge(left, right, on='key1', suffixes=['_left', '_right'])

  key1 key2_left  lval key2_right  rval
0  foo       one     1        one     4
1  foo       one     1        one     5
2  foo       two     2        one     4
3  foo       two     2        one     5
4  bar       one     3        one     6
5  bar       one     3        two     7

In [55]:
left1 = pd.DataFrame({'key': ['a', 'b', 'a', 'a', 'b', 'c'],
                      'value': pd.Series(range(6), dtype='Int64')})
right1 = pd.DataFrame({'group_val': [3.5, 7]}, index=['a', 'b'])
pd.merge(left1, right1, left_on='key', right_index=True)

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0

In [56]:
pd.merge(left1, right1, left_on='key', right_index=True, how='outer')

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0
5   c      5        NaN

In [46]:
lefth = pd.DataFrame({'key1': ['Ohio', 'Ohio', 'Colorado', 'Nevada', 'Nevada'],
                      'key2': [2000, 2001, 2002, 2001, 2002],
                      'data': pd.Series(range(5), dtype='Int64')})
righth_index = pd.MultiIndex.from_arrays([['Nevada', 'Nevada', 'Colorado', 'Ohio', 'Ohio', 'Ohio'],
                                    [2001, 2002, 2002, 2000, 2001, 2002]])
righth = pd.DataFrame({'event1': pd.Series([0, 2, 4, 6, 8, 10], dtype='Int64', index=righth_index),
                       'event2': pd.Series([1, 3, 5, 7, 9, 11], dtype='Int64', index=righth_index)})
lefth

       key1  key2  data
0      Ohio  2000     0
1      Ohio  2001     1
2  Colorado  2002     2
3    Nevada  2001     3
4    Nevada  2002     4

In [47]:
righth

               event1  event2
Nevada   2001       0       1
         2002       2       3
Colorado 2002       4       5
Ohio     2000       6       7
         2001       8       9
         2002      10      11

In [48]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True)

       key1  key2  data  event1  event2
0      Ohio  2000     0       6       7
1      Ohio  2001     1       8       9
2  Colorado  2002     2       4       5
3    Nevada  2001     3       0       1
4    Nevada  2002     4       2       3

In [49]:
pd.merge(lefth, righth, left_on=['key1', 'key2'], right_index=True, how='outer')

       key1  key2  data  event1  event2
2  Colorado  2002     2       4       5
3    Nevada  2001     3       0       1
4    Nevada  2002     4       2       3
0      Ohio  2000     0       6       7
1      Ohio  2001     1       8       9
4      Ohio  2002  <NA>      10      11

In [50]:
left2 = pd.DataFrame([[1., 2.], [3., 4.], [5., 6.]],
                     index=['a', 'c', 'e'],
                     columns=['Ohio', 'Colorado'])
right2 = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [13., 14.]],
                      index=['b', 'c', 'd', 'e'],
                      columns=['Alabma', 'Texas'])
left2

   Ohio  Colorado
a   1.0       2.0
c   3.0       4.0
e   5.0       6.0

In [51]:
right2

   Alabma  Texas
b     7.0    8.0
c     9.0   10.0
d    11.0   12.0
e    13.0   14.0

In [52]:
pd.merge(left2, right2, left_index=True, right_index=True, how='outer')

   Ohio  Colorado  Alabma  Texas
a   1.0       2.0     NaN    NaN
b   NaN       NaN     7.0    8.0
c   3.0       4.0     9.0   10.0
d   NaN       NaN    11.0   12.0
e   5.0       6.0    13.0   14.0

In [53]:
left2.join(right2, how='outer')

   Ohio  Colorado  Alabma  Texas
a   1.0       2.0     NaN    NaN
b   NaN       NaN     7.0    8.0
c   3.0       4.0     9.0   10.0
d   NaN       NaN    11.0   12.0
e   5.0       6.0    13.0   14.0

In [57]:
left1.join(right1, on='key')

  key  value  group_val
0   a      0        3.5
1   b      1        7.0
2   a      2        3.5
3   a      3        3.5
4   b      4        7.0
5   c      5        NaN

In [58]:
another = pd.DataFrame([[7., 8.], [9., 10.], [11., 12.], [16., 17.]],
                       index=['a', 'c', 'e', 'f'], columns=['NewYork', 'Oregon'])
another

   NewYork  Oregon
a      7.0     8.0
c      9.0    10.0
e     11.0    12.0
f     16.0    17.0

In [59]:
left2.join([right2, another])

   Ohio  Colorado  Alabma  Texas  NewYork  Oregon
a   1.0       2.0     NaN    NaN      7.0     8.0
c   3.0       4.0     9.0   10.0      9.0    10.0
e   5.0       6.0    13.0   14.0     11.0    12.0

In [60]:
left2.join([right2, another], how='outer')

   Ohio  Colorado  Alabma  Texas  NewYork  Oregon
a   1.0       2.0     NaN    NaN      7.0     8.0
c   3.0       4.0     9.0   10.0      9.0    10.0
e   5.0       6.0    13.0   14.0     11.0    12.0
b   NaN       NaN     7.0    8.0      NaN     NaN
d   NaN       NaN    11.0   12.0      NaN     NaN
f   NaN       NaN     NaN    NaN     16.0    17.0